zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K312_172HDQFP-pinctrl.h
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on S32K311_K310_100HDQFP-pinctrl.h with this part's differences applied
 * below (24 removed, 0 changed,
 * 442 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 4857b10565a5e56f
 */

#ifndef _ZEPHYR_DTS_BINDING_S32K312_172HDQFP_WRAPPER_
#define _ZEPHYR_DTS_BINDING_S32K312_172HDQFP_WRAPPER_

#include "S32K311_K310_100HDQFP-pinctrl.h"

/* Signals not present on this part */
#undef PTA15_LPUART1_DTR_B
#undef PTA16_LPUART1_DSR_B
#undef PTA4_LPI2C1_SDA_I
#undef PTA4_LPI2C1_SDA_O
#undef PTA6_LPUART0_RIN_B
#undef PTA7_LPUART0_DCD_B
#undef PTB10_LPUART0_DTR_B
#undef PTB11_LPUART0_DSR_B
#undef PTB12_LPUART0_DCD_B
#undef PTB13_LPUART0_RIN_B
#undef PTB4_CLKOUT_STANDBY
#undef PTB8_LPUART1_DCD_B
#undef PTB9_LPUART1_RIN_B
#undef PTC10_LCU0_OUT1
#undef PTC10_LPUART0_DSR_B
#undef PTC11_LCU0_OUT0
#undef PTC11_LPUART0_DTR_B
#undef PTC2_CAN1_RX
#undef PTC3_CAN1_TX
#undef PTC4_LPI2C1_SCL_I
#undef PTC4_LPI2C1_SCL_O
#undef PTD0_TRGMUX_IN7
#undef PTD1_TRGMUX_IN6
#undef PTE11_TRGMUX_IN8

/* Signals specific to this part */
#define PTA12_CMP1_OUT                  NXP_SIUL2_PINMUX(0, 0, 12, 7, 0, 0)
#define PTA15_FXIO_D31_I                NXP_SIUL2_PINMUX(0, 0, 15, 0, 183, 1)
#define PTA15_FXIO_D31_O                NXP_SIUL2_PINMUX(0, 0, 15, 7, 0, 0)
#define PTA15_LPUART6_RX                NXP_SIUL2_PINMUX(0, 0, 15, 0, 193, 2)
#define PTA16_FXIO_D30_I                NXP_SIUL2_PINMUX(0, 0, 16, 0, 182, 1)
#define PTA16_FXIO_D30_O                NXP_SIUL2_PINMUX(0, 0, 16, 7, 0, 0)
#define PTA16_LPUART6_TX_I              NXP_SIUL2_PINMUX(0, 0, 16, 0, 369, 1)
#define PTA16_LPUART6_TX_O              NXP_SIUL2_PINMUX(0, 0, 16, 5, 0, 0)
#define PTA17_EMIOS_0_CH6_G_I           NXP_SIUL2_PINMUX(0, 0, 17, 0, 54, 2)
#define PTA17_EMIOS_0_CH6_G_O           NXP_SIUL2_PINMUX(0, 0, 17, 2, 0, 0)
#define PTA17_FXIO_D19_I                NXP_SIUL2_PINMUX(0, 0, 17, 0, 171, 1)
#define PTA17_FXIO_D19_O                NXP_SIUL2_PINMUX(0, 0, 17, 7, 0, 0)
#define PTA17_LPSPI3_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 17, 0, 254, 2)
#define PTA17_LPSPI3_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 17, 6, 0, 0)
#define PTA17_LPUART4_TX_I              NXP_SIUL2_PINMUX(0, 0, 17, 0, 367, 1)
#define PTA17_LPUART4_TX_O              NXP_SIUL2_PINMUX(0, 0, 17, 4, 0, 0)
#define PTA18_EIRQ0                     NXP_SIUL2_PINMUX(0, 0, 18, 0, 16, 2)
#define PTA18_EMIOS_1_CH0_X_I           NXP_SIUL2_PINMUX(0, 0, 18, 0, 80, 1)
#define PTA18_EMIOS_1_CH0_X_O           NXP_SIUL2_PINMUX(0, 0, 18, 2, 0, 0)
#define PTA18_EMIOS_1_CH16_X_I          NXP_SIUL2_PINMUX(0, 0, 18, 0, 96, 1)
#define PTA18_EMIOS_1_CH16_X_O          NXP_SIUL2_PINMUX(0, 0, 18, 5, 0, 0)
#define PTA18_LPSPI1_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 18, 0, 240, 4)
#define PTA18_LPSPI1_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 18, 4, 0, 0)
#define PTA18_LPUART1_TX_I              NXP_SIUL2_PINMUX(0, 0, 18, 0, 364, 4)
#define PTA18_LPUART1_TX_O              NXP_SIUL2_PINMUX(0, 0, 18, 3, 0, 0)
#define PTA18_TRGMUX_IN12               NXP_SIUL2_PINMUX(0, 0, 18, 0, 356, 1)
#define PTA19_EIRQ1                     NXP_SIUL2_PINMUX(0, 0, 19, 0, 17, 2)
#define PTA19_EMIOS_1_CH1_H_I           NXP_SIUL2_PINMUX(0, 0, 19, 0, 81, 1)
#define PTA19_EMIOS_1_CH1_H_O           NXP_SIUL2_PINMUX(0, 0, 19, 2, 0, 0)
#define PTA19_LPSPI1_SCK_I              NXP_SIUL2_PINMUX(0, 0, 19, 0, 238, 3)
#define PTA19_LPSPI1_SCK_O              NXP_SIUL2_PINMUX(0, 0, 19, 4, 0, 0)
#define PTA19_LPUART1_RX                NXP_SIUL2_PINMUX(0, 0, 19, 0, 188, 5)
#define PTA19_TRGMUX_IN13               NXP_SIUL2_PINMUX(0, 0, 19, 0, 357, 1)
#define PTA20_EIRQ2                     NXP_SIUL2_PINMUX(0, 0, 20, 0, 18, 2)
#define PTA20_EMIOS_1_CH2_H_I           NXP_SIUL2_PINMUX(0, 0, 20, 0, 82, 2)
#define PTA20_EMIOS_1_CH2_H_O           NXP_SIUL2_PINMUX(0, 0, 20, 2, 0, 0)
#define PTA20_LPSPI1_SIN_I              NXP_SIUL2_PINMUX(0, 0, 20, 0, 239, 3)
#define PTA20_LPSPI1_SIN_O              NXP_SIUL2_PINMUX(0, 0, 20, 4, 0, 0)
#define PTA20_TRGMUX_IN14               NXP_SIUL2_PINMUX(0, 0, 20, 0, 358, 1)
#define PTA21_EIRQ3                     NXP_SIUL2_PINMUX(0, 0, 21, 0, 19, 2)
#define PTA21_EMIOS_1_CH3_H_I           NXP_SIUL2_PINMUX(0, 0, 21, 0, 83, 1)
#define PTA21_EMIOS_1_CH3_H_O           NXP_SIUL2_PINMUX(0, 0, 21, 2, 0, 0)
#define PTA21_FXIO_D0_I                 NXP_SIUL2_PINMUX(0, 0, 21, 0, 152, 3)
#define PTA21_FXIO_D0_O                 NXP_SIUL2_PINMUX(0, 0, 21, 3, 0, 0)
#define PTA21_LPSPI1_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 21, 0, 232, 3)
#define PTA21_LPSPI1_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 21, 4, 0, 0)
#define PTA21_LPSPI2_PCS2_I             NXP_SIUL2_PINMUX(0, 0, 21, 0, 243, 1)
#define PTA21_LPSPI2_PCS2_O             NXP_SIUL2_PINMUX(0, 0, 21, 1, 0, 0)
#define PTA21_TRGMUX_IN15               NXP_SIUL2_PINMUX(0, 0, 21, 0, 359, 1)
#define PTA24_EMIOS_1_CH7_H             NXP_SIUL2_PINMUX(0, 0, 21, 0, 87, 2)
#define PTA24_FXIO_D3                   NXP_SIUL2_PINMUX(0, 0, 21, 0, 155, 3)
#define PTA24_GPI24                     NXP_SIUL2_PINMUX(0, 0, 21, 0, 24, 0)
#define PTA25_EIRQ5                     NXP_SIUL2_PINMUX(0, 0, 21, 0, 21, 2)
#define PTA25_EMIOS_1_CH8_X             NXP_SIUL2_PINMUX(0, 0, 21, 0, 88, 2)
#define PTA25_FXIO_D2                   NXP_SIUL2_PINMUX(0, 0, 21, 0, 154, 6)
#define PTA25_GPI25                     NXP_SIUL2_PINMUX(0, 0, 21, 0, 25, 0)
#define PTA27_CAN0_TX                   NXP_SIUL2_PINMUX(0, 0, 27, 5, 0, 0)
#define PTA27_EMIOS_1_CH10_H_I          NXP_SIUL2_PINMUX(0, 0, 27, 0, 90, 3)
#define PTA27_EMIOS_1_CH10_H_O          NXP_SIUL2_PINMUX(0, 0, 27, 2, 0, 0)
#define PTA27_FXIO_D5_I                 NXP_SIUL2_PINMUX(0, 0, 27, 0, 157, 9)
#define PTA27_FXIO_D5_O                 NXP_SIUL2_PINMUX(0, 0, 27, 1, 0, 0)
#define PTA27_LPUART0_TX_I              NXP_SIUL2_PINMUX(0, 0, 27, 0, 363, 4)
#define PTA27_LPUART0_TX_O              NXP_SIUL2_PINMUX(0, 0, 27, 4, 0, 0)
#define PTA28_CAN0_RX                   NXP_SIUL2_PINMUX(0, 0, 28, 0, 0, 4)
#define PTA28_EIRQ6                     NXP_SIUL2_PINMUX(0, 0, 28, 0, 22, 2)
#define PTA28_EMIOS_1_CH11_H_I          NXP_SIUL2_PINMUX(0, 0, 28, 0, 91, 2)
#define PTA28_EMIOS_1_CH11_H_O          NXP_SIUL2_PINMUX(0, 0, 28, 2, 0, 0)
#define PTA28_LPSPI1_SCK_I              NXP_SIUL2_PINMUX(0, 0, 28, 0, 238, 4)
#define PTA28_LPSPI1_SCK_O              NXP_SIUL2_PINMUX(0, 0, 28, 3, 0, 0)
#define PTA28_LPUART0_RX                NXP_SIUL2_PINMUX(0, 0, 28, 0, 187, 4)
#define PTA29_EMIOS_1_CH12_H_I          NXP_SIUL2_PINMUX(0, 0, 29, 0, 92, 3)
#define PTA29_EMIOS_1_CH12_H_O          NXP_SIUL2_PINMUX(0, 0, 29, 2, 0, 0)
#define PTA29_LPSPI1_SIN_I              NXP_SIUL2_PINMUX(0, 0, 29, 0, 239, 4)
#define PTA29_LPSPI1_SIN_O              NXP_SIUL2_PINMUX(0, 0, 29, 5, 0, 0)
#define PTA29_LPUART2_TX_I              NXP_SIUL2_PINMUX(0, 0, 29, 0, 365, 5)
#define PTA29_LPUART2_TX_O              NXP_SIUL2_PINMUX(0, 0, 29, 4, 0, 0)
#define PTA30_EIRQ7                     NXP_SIUL2_PINMUX(0, 0, 30, 0, 23, 2)
#define PTA30_EMIOS_1_CH13_H_I          NXP_SIUL2_PINMUX(0, 0, 30, 0, 93, 2)
#define PTA30_EMIOS_1_CH13_H_O          NXP_SIUL2_PINMUX(0, 0, 30, 2, 0, 0)
#define PTA30_LPSPI0_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 30, 0, 231, 4)
#define PTA30_LPSPI0_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 30, 4, 0, 0)
#define PTA30_LPSPI1_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 30, 0, 240, 5)
#define PTA30_LPSPI1_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 30, 3, 0, 0)
#define PTA30_LPUART2_RX                NXP_SIUL2_PINMUX(0, 0, 30, 0, 189, 4)
#define PTA31_EMIOS_1_CH14_H_I          NXP_SIUL2_PINMUX(0, 0, 31, 0, 94, 2)
#define PTA31_EMIOS_1_CH14_H_O          NXP_SIUL2_PINMUX(0, 0, 31, 2, 0, 0)
#define PTA31_FXIO_D0_I                 NXP_SIUL2_PINMUX(0, 0, 31, 0, 152, 6)
#define PTA31_FXIO_D0_O                 NXP_SIUL2_PINMUX(0, 0, 31, 3, 0, 0)
#define PTA31_LPSPI0_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 31, 0, 222, 2)
#define PTA31_LPSPI0_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 31, 4, 0, 0)
#define PTA31_TRGMUX_OUT8               NXP_SIUL2_PINMUX(0, 0, 31, 7, 0, 0)
#define PTA6_FXIO_D19_I                 NXP_SIUL2_PINMUX(0, 0, 6, 0, 171, 4)
#define PTA6_FXIO_D19_O                 NXP_SIUL2_PINMUX(0, 0, 6, 5, 0, 0)
#define PTB10_FXIO_D27_I                NXP_SIUL2_PINMUX(0, 0, 42, 0, 179, 1)
#define PTB10_FXIO_D27_O                NXP_SIUL2_PINMUX(0, 0, 42, 7, 0, 0)
#define PTB11_FXIO_D26_I                NXP_SIUL2_PINMUX(0, 0, 43, 0, 178, 1)
#define PTB11_FXIO_D26_O                NXP_SIUL2_PINMUX(0, 0, 43, 7, 0, 0)
#define PTB12_FXIO_D25_I                NXP_SIUL2_PINMUX(0, 0, 44, 0, 177, 1)
#define PTB12_FXIO_D25_O                NXP_SIUL2_PINMUX(0, 0, 44, 7, 0, 0)
#define PTB13_FXIO_D24_I                NXP_SIUL2_PINMUX(0, 0, 45, 0, 176, 1)
#define PTB13_FXIO_D24_O                NXP_SIUL2_PINMUX(0, 0, 45, 7, 0, 0)
#define PTB14_FXIO_D23_I                NXP_SIUL2_PINMUX(0, 0, 46, 0, 175, 1)
#define PTB14_FXIO_D23_O                NXP_SIUL2_PINMUX(0, 0, 46, 7, 0, 0)
#define PTB14_LPUART7_RX                NXP_SIUL2_PINMUX(0, 0, 46, 0, 194, 1)
#define PTB15_FXIO_D22_I                NXP_SIUL2_PINMUX(0, 0, 47, 0, 174, 1)
#define PTB15_FXIO_D22_O                NXP_SIUL2_PINMUX(0, 0, 47, 7, 0, 0)
#define PTB15_LPUART7_TX_I              NXP_SIUL2_PINMUX(0, 0, 47, 0, 370, 1)
#define PTB15_LPUART7_TX_O              NXP_SIUL2_PINMUX(0, 0, 47, 6, 0, 0)
#define PTB16_FXIO_D21_I                NXP_SIUL2_PINMUX(0, 0, 48, 0, 173, 1)
#define PTB16_FXIO_D21_O                NXP_SIUL2_PINMUX(0, 0, 48, 7, 0, 0)
#define PTB16_LPUART4_TX_I              NXP_SIUL2_PINMUX(0, 0, 48, 0, 367, 2)
#define PTB16_LPUART4_TX_O              NXP_SIUL2_PINMUX(0, 0, 48, 4, 0, 0)
#define PTB17_FXIO_D20_I                NXP_SIUL2_PINMUX(0, 0, 49, 0, 172, 1)
#define PTB17_FXIO_D20_O                NXP_SIUL2_PINMUX(0, 0, 49, 7, 0, 0)
#define PTB17_LPUART4_RX                NXP_SIUL2_PINMUX(0, 0, 49, 0, 191, 3)
#define PTB18_EMIOS_1_CH15_H_I          NXP_SIUL2_PINMUX(0, 0, 50, 0, 95, 2)
#define PTB18_EMIOS_1_CH15_H_O          NXP_SIUL2_PINMUX(0, 0, 50, 2, 0, 0)
#define PTB18_FXIO_D1_I                 NXP_SIUL2_PINMUX(0, 0, 50, 0, 153, 6)
#define PTB18_FXIO_D1_O                 NXP_SIUL2_PINMUX(0, 0, 50, 3, 0, 0)
#define PTB18_LPSPI1_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 50, 0, 233, 2)
#define PTB18_LPSPI1_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 50, 4, 0, 0)
#define PTB18_TRGMUX_OUT9               NXP_SIUL2_PINMUX(0, 0, 50, 7, 0, 0)
#define PTB19_EMIOS_1_CH15_H_I          NXP_SIUL2_PINMUX(0, 0, 51, 0, 95, 3)
#define PTB19_EMIOS_1_CH15_H_O          NXP_SIUL2_PINMUX(0, 0, 51, 2, 0, 0)
#define PTB19_FXIO_D2_I                 NXP_SIUL2_PINMUX(0, 0, 51, 0, 154, 5)
#define PTB19_FXIO_D2_O                 NXP_SIUL2_PINMUX(0, 0, 51, 3, 0, 0)
#define PTB19_TRGMUX_OUT10              NXP_SIUL2_PINMUX(0, 0, 51, 7, 0, 0)
#define PTB20_EMIOS_1_CH16_X_I          NXP_SIUL2_PINMUX(0, 0, 52, 0, 96, 3)
#define PTB20_EMIOS_1_CH16_X_O          NXP_SIUL2_PINMUX(0, 0, 52, 2, 0, 0)
#define PTB20_FXIO_D3_I                 NXP_SIUL2_PINMUX(0, 0, 52, 0, 155, 5)
#define PTB20_FXIO_D3_O                 NXP_SIUL2_PINMUX(0, 0, 52, 3, 0, 0)
#define PTB20_TRGMUX_OUT11              NXP_SIUL2_PINMUX(0, 0, 52, 7, 0, 0)
#define PTB21_EIRQ8                     NXP_SIUL2_PINMUX(0, 0, 53, 0, 24, 2)
#define PTB21_EMIOS_1_CH17_Y_I          NXP_SIUL2_PINMUX(0, 0, 53, 0, 97, 2)
#define PTB21_EMIOS_1_CH17_Y_O          NXP_SIUL2_PINMUX(0, 0, 53, 2, 0, 0)
#define PTB21_FXIO_D4_I                 NXP_SIUL2_PINMUX(0, 0, 53, 0, 156, 5)
#define PTB21_FXIO_D4_O                 NXP_SIUL2_PINMUX(0, 0, 53, 3, 0, 0)
#define PTB21_TRGMUX_OUT12              NXP_SIUL2_PINMUX(0, 0, 53, 7, 0, 0)
#define PTB22_CAN1_TX                   NXP_SIUL2_PINMUX(0, 0, 54, 1, 0, 0)
#define PTB22_EIRQ9                     NXP_SIUL2_PINMUX(0, 0, 54, 0, 25, 2)
#define PTB22_EMIOS_1_CH18_Y_I          NXP_SIUL2_PINMUX(0, 0, 54, 0, 98, 2)
#define PTB22_EMIOS_1_CH18_Y_O          NXP_SIUL2_PINMUX(0, 0, 54, 2, 0, 0)
#define PTB22_FXIO_D15_I                NXP_SIUL2_PINMUX(0, 0, 54, 0, 167, 5)
#define PTB22_FXIO_D15_O                NXP_SIUL2_PINMUX(0, 0, 54, 6, 0, 0)
#define PTB22_LPSPI3_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 54, 0, 249, 4)
#define PTB22_LPSPI3_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 54, 3, 0, 0)
#define PTB22_LPUART1_TX_I              NXP_SIUL2_PINMUX(0, 0, 54, 0, 364, 5)
#define PTB22_LPUART1_TX_O              NXP_SIUL2_PINMUX(0, 0, 54, 5, 0, 0)
#define PTB22_TRGMUX_OUT13              NXP_SIUL2_PINMUX(0, 0, 54, 7, 0, 0)
#define PTB23_ADC1_MA0                  NXP_SIUL2_PINMUX(0, 0, 55, 1, 0, 0)
#define PTB23_CAN1_RX                   NXP_SIUL2_PINMUX(0, 0, 55, 0, 1, 4)
#define PTB23_EIRQ10                    NXP_SIUL2_PINMUX(0, 0, 55, 0, 26, 2)
#define PTB23_EMIOS_1_CH19_Y_I          NXP_SIUL2_PINMUX(0, 0, 55, 0, 99, 2)
#define PTB23_EMIOS_1_CH19_Y_O          NXP_SIUL2_PINMUX(0, 0, 55, 2, 0, 0)
#define PTB23_FXIO_D4_I                 NXP_SIUL2_PINMUX(0, 0, 55, 0, 156, 6)
#define PTB23_FXIO_D4_O                 NXP_SIUL2_PINMUX(0, 0, 55, 3, 0, 0)
#define PTB23_LPUART1_RX                NXP_SIUL2_PINMUX(0, 0, 55, 0, 188, 4)
#define PTB23_TRGMUX_OUT14              NXP_SIUL2_PINMUX(0, 0, 55, 7, 0, 0)
#define PTB24_ADC1_MA1                  NXP_SIUL2_PINMUX(0, 0, 56, 1, 0, 0)
#define PTB24_EIRQ11                    NXP_SIUL2_PINMUX(0, 0, 56, 0, 27, 2)
#define PTB24_EMIOS_1_CH20_Y_I          NXP_SIUL2_PINMUX(0, 0, 56, 0, 100, 2)
#define PTB24_EMIOS_1_CH20_Y_O          NXP_SIUL2_PINMUX(0, 0, 56, 2, 0, 0)
#define PTB24_FXIO_D5_I                 NXP_SIUL2_PINMUX(0, 0, 56, 0, 157, 6)
#define PTB24_FXIO_D5_O                 NXP_SIUL2_PINMUX(0, 0, 56, 3, 0, 0)
#define PTB25_EIRQ12                    NXP_SIUL2_PINMUX(0, 0, 57, 0, 28, 2)
#define PTB25_EMIOS_1_CH21_Y_I          NXP_SIUL2_PINMUX(0, 0, 57, 0, 101, 2)
#define PTB25_EMIOS_1_CH21_Y_O          NXP_SIUL2_PINMUX(0, 0, 57, 2, 0, 0)
#define PTB25_FXIO_D6_I                 NXP_SIUL2_PINMUX(0, 0, 57, 0, 158, 5)
#define PTB25_FXIO_D6_O                 NXP_SIUL2_PINMUX(0, 0, 57, 3, 0, 0)
#define PTB25_LPSPI2_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 57, 0, 241, 4)
#define PTB25_LPSPI2_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 57, 5, 0, 0)
#define PTB26_EIRQ13                    NXP_SIUL2_PINMUX(0, 0, 58, 0, 29, 2)
#define PTB26_EMIOS_1_CH22_X_I          NXP_SIUL2_PINMUX(0, 0, 58, 0, 102, 2)
#define PTB26_EMIOS_1_CH22_X_O          NXP_SIUL2_PINMUX(0, 0, 58, 2, 0, 0)
#define PTB26_FXIO_D7_I                 NXP_SIUL2_PINMUX(0, 0, 58, 0, 159, 6)
#define PTB26_FXIO_D7_O                 NXP_SIUL2_PINMUX(0, 0, 58, 3, 0, 0)
#define PTB27_EMIOS_1_CH23_X_I          NXP_SIUL2_PINMUX(0, 0, 59, 0, 103, 2)
#define PTB27_EMIOS_1_CH23_X_O          NXP_SIUL2_PINMUX(0, 0, 59, 2, 0, 0)
#define PTB27_FXIO_D8_I                 NXP_SIUL2_PINMUX(0, 0, 59, 0, 160, 2)
#define PTB27_FXIO_D8_O                 NXP_SIUL2_PINMUX(0, 0, 59, 3, 0, 0)
#define PTB27_LPSPI2_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 59, 0, 247, 3)
#define PTB27_LPSPI2_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 59, 5, 0, 0)
#define PTB27_LPUART5_TX_I              NXP_SIUL2_PINMUX(0, 0, 59, 0, 368, 3)
#define PTB27_LPUART5_TX_O              NXP_SIUL2_PINMUX(0, 0, 59, 1, 0, 0)
#define PTB28_ADC1_MA2                  NXP_SIUL2_PINMUX(0, 0, 60, 1, 0, 0)
#define PTB28_EIRQ14                    NXP_SIUL2_PINMUX(0, 0, 60, 0, 30, 2)
#define PTB28_FXIO_D9_I                 NXP_SIUL2_PINMUX(0, 0, 60, 0, 161, 2)
#define PTB28_FXIO_D9_O                 NXP_SIUL2_PINMUX(0, 0, 60, 3, 0, 0)
#define PTB28_LCU1_OUT11                NXP_SIUL2_PINMUX(0, 0, 60, 6, 0, 0)
#define PTB28_LPSPI2_SIN_I              NXP_SIUL2_PINMUX(0, 0, 60, 0, 246, 3)
#define PTB28_LPSPI2_SIN_O              NXP_SIUL2_PINMUX(0, 0, 60, 5, 0, 0)
#define PTB28_LPUART5_RX                NXP_SIUL2_PINMUX(0, 0, 60, 0, 192, 4)
#define PTB29_FXIO_D10_I                NXP_SIUL2_PINMUX(0, 0, 61, 0, 162, 2)
#define PTB29_FXIO_D10_O                NXP_SIUL2_PINMUX(0, 0, 61, 3, 0, 0)
#define PTB29_LCU1_OUT10                NXP_SIUL2_PINMUX(0, 0, 61, 6, 0, 0)
#define PTB29_LPSPI2_SCK_I              NXP_SIUL2_PINMUX(0, 0, 61, 0, 245, 3)
#define PTB29_LPSPI2_SCK_O              NXP_SIUL2_PINMUX(0, 0, 61, 5, 0, 0)
#define PTB29_LPUART6_TX_I              NXP_SIUL2_PINMUX(0, 0, 61, 0, 369, 3)
#define PTB29_LPUART6_TX_O              NXP_SIUL2_PINMUX(0, 0, 61, 1, 0, 0)
#define PTB2_CAN4_RX                    NXP_SIUL2_PINMUX(0, 0, 34, 0, 4, 2)
#define PTB2_FXIO_D18_I                 NXP_SIUL2_PINMUX(0, 0, 34, 0, 170, 1)
#define PTB2_FXIO_D18_O                 NXP_SIUL2_PINMUX(0, 0, 34, 7, 0, 0)
#define PTB30_FXIO_D11_I                NXP_SIUL2_PINMUX(0, 0, 62, 0, 163, 2)
#define PTB30_FXIO_D11_O                NXP_SIUL2_PINMUX(0, 0, 62, 3, 0, 0)
#define PTB30_HSE_TAMPER_LOOP_OUT0      NXP_SIUL2_PINMUX(0, 0, 62, 5, 0, 0)
#define PTB3_CAN4_TX                    NXP_SIUL2_PINMUX(0, 0, 35, 5, 0, 0)
#define PTB3_FXIO_D17_I                 NXP_SIUL2_PINMUX(0, 0, 35, 0, 169, 1)
#define PTB3_FXIO_D17_O                 NXP_SIUL2_PINMUX(0, 0, 35, 7, 0, 0)
#define PTB8_FXIO_D29_I                 NXP_SIUL2_PINMUX(0, 0, 40, 0, 181, 1)
#define PTB8_FXIO_D29_O                 NXP_SIUL2_PINMUX(0, 0, 40, 7, 0, 0)
#define PTB9_FXIO_D28_I                 NXP_SIUL2_PINMUX(0, 0, 41, 0, 180, 1)
#define PTB9_FXIO_D28_O                 NXP_SIUL2_PINMUX(0, 0, 41, 7, 0, 0)
#define PTC0_CAN3_TX                    NXP_SIUL2_PINMUX(0, 0, 64, 1, 0, 0)
#define PTC10_CAN5_TX                   NXP_SIUL2_PINMUX(0, 0, 74, 3, 0, 0)
#define PTC11_CAN5_RX                   NXP_SIUL2_PINMUX(0, 0, 75, 0, 5, 2)
#define PTC11_FXIO_D19_I                NXP_SIUL2_PINMUX(0, 0, 75, 0, 171, 3)
#define PTC11_FXIO_D19_O                NXP_SIUL2_PINMUX(0, 0, 75, 6, 0, 0)
#define PTC12_FXIO_D19_I                NXP_SIUL2_PINMUX(0, 0, 76, 0, 171, 5)
#define PTC12_FXIO_D19_O                NXP_SIUL2_PINMUX(0, 0, 76, 5, 0, 0)
#define PTC13_FXIO_D16_I                NXP_SIUL2_PINMUX(0, 0, 77, 0, 168, 3)
#define PTC13_FXIO_D16_O                NXP_SIUL2_PINMUX(0, 0, 77, 5, 0, 0)
#define PTC14_FXIO_D16_I                NXP_SIUL2_PINMUX(0, 0, 78, 0, 168, 1)
#define PTC14_FXIO_D16_O                NXP_SIUL2_PINMUX(0, 0, 78, 7, 0, 0)
#define PTC18_FXIO_D12_I                NXP_SIUL2_PINMUX(0, 0, 82, 0, 164, 2)
#define PTC18_FXIO_D12_O                NXP_SIUL2_PINMUX(0, 0, 82, 3, 0, 0)
#define PTC18_FXIO_D6_I                 NXP_SIUL2_PINMUX(0, 0, 82, 0, 158, 9)
#define PTC18_FXIO_D6_O                 NXP_SIUL2_PINMUX(0, 0, 82, 2, 0, 0)
#define PTC18_LCU1_OUT7                 NXP_SIUL2_PINMUX(0, 0, 82, 6, 0, 0)
#define PTC18_LPUART6_RX                NXP_SIUL2_PINMUX(0, 0, 82, 0, 193, 4)
#define PTC19_FXIO_D13_I                NXP_SIUL2_PINMUX(0, 0, 83, 0, 165, 2)
#define PTC19_FXIO_D13_O                NXP_SIUL2_PINMUX(0, 0, 83, 3, 0, 0)
#define PTC19_LCU1_OUT6                 NXP_SIUL2_PINMUX(0, 0, 83, 6, 0, 0)
#define PTC19_LPSPI2_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 83, 0, 242, 2)
#define PTC19_LPSPI2_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 83, 5, 0, 0)
#define PTC19_LPUART7_TX_I              NXP_SIUL2_PINMUX(0, 0, 83, 0, 370, 2)
#define PTC19_LPUART7_TX_O              NXP_SIUL2_PINMUX(0, 0, 83, 1, 0, 0)
#define PTC1_CAN3_RX                    NXP_SIUL2_PINMUX(0, 0, 65, 0, 3, 2)
#define PTC20_ADC1_MA2                  NXP_SIUL2_PINMUX(0, 0, 84, 5, 0, 0)
#define PTC20_EIRQ16                    NXP_SIUL2_PINMUX(0, 0, 84, 0, 32, 3)
#define PTC20_FXIO_D14_I                NXP_SIUL2_PINMUX(0, 0, 84, 0, 166, 2)
#define PTC20_FXIO_D14_O                NXP_SIUL2_PINMUX(0, 0, 84, 3, 0, 0)
#define PTC20_LCU1_OUT5                 NXP_SIUL2_PINMUX(0, 0, 84, 6, 0, 0)
#define PTC20_LPUART7_RX                NXP_SIUL2_PINMUX(0, 0, 84, 0, 194, 4)
#define PTC21_ADC1_MA1                  NXP_SIUL2_PINMUX(0, 0, 85, 5, 0, 0)
#define PTC21_EIRQ17                    NXP_SIUL2_PINMUX(0, 0, 85, 0, 33, 3)
#define PTC21_FXIO_D15_I                NXP_SIUL2_PINMUX(0, 0, 85, 0, 167, 2)
#define PTC21_FXIO_D15_O                NXP_SIUL2_PINMUX(0, 0, 85, 3, 0, 0)
#define PTC21_LCU1_OUT4                 NXP_SIUL2_PINMUX(0, 0, 85, 6, 0, 0)
#define PTC23_EIRQ18                    NXP_SIUL2_PINMUX(0, 0, 87, 0, 34, 3)
#define PTC23_FXIO_D16_I                NXP_SIUL2_PINMUX(0, 0, 87, 0, 168, 2)
#define PTC23_FXIO_D16_O                NXP_SIUL2_PINMUX(0, 0, 87, 3, 0, 0)
#define PTC23_LCU1_OUT0                 NXP_SIUL2_PINMUX(0, 0, 87, 6, 0, 0)
#define PTC24_EIRQ19                    NXP_SIUL2_PINMUX(0, 0, 88, 0, 35, 3)
#define PTC24_EMIOS_1_CH0_X_I           NXP_SIUL2_PINMUX(0, 0, 88, 0, 80, 4)
#define PTC24_EMIOS_1_CH0_X_O           NXP_SIUL2_PINMUX(0, 0, 88, 2, 0, 0)
#define PTC24_FXIO_D17_I                NXP_SIUL2_PINMUX(0, 0, 88, 0, 169, 2)
#define PTC24_FXIO_D17_O                NXP_SIUL2_PINMUX(0, 0, 88, 3, 0, 0)
#define PTC24_LCU1_OUT1                 NXP_SIUL2_PINMUX(0, 0, 88, 6, 0, 0)
#define PTC24_TRGMUX_OUT15              NXP_SIUL2_PINMUX(0, 0, 88, 7, 0, 0)
#define PTC25_EIRQ20                    NXP_SIUL2_PINMUX(0, 0, 89, 0, 36, 3)
#define PTC25_EMIOS_1_CH1_H_I           NXP_SIUL2_PINMUX(0, 0, 89, 0, 81, 4)
#define PTC25_EMIOS_1_CH1_H_O           NXP_SIUL2_PINMUX(0, 0, 89, 2, 0, 0)
#define PTC25_FXIO_D18_I                NXP_SIUL2_PINMUX(0, 0, 89, 0, 170, 2)
#define PTC25_FXIO_D18_O                NXP_SIUL2_PINMUX(0, 0, 89, 3, 0, 0)
#define PTC25_LCU1_OUT2                 NXP_SIUL2_PINMUX(0, 0, 89, 6, 0, 0)
#define PTC26_CAN5_RX                   NXP_SIUL2_PINMUX(0, 0, 90, 0, 5, 5)
#define PTC26_EIRQ21                    NXP_SIUL2_PINMUX(0, 0, 90, 0, 37, 3)
#define PTC26_EMIOS_1_CH3_H_I           NXP_SIUL2_PINMUX(0, 0, 90, 0, 83, 3)
#define PTC26_EMIOS_1_CH3_H_O           NXP_SIUL2_PINMUX(0, 0, 90, 2, 0, 0)
#define PTC26_FXIO_D19_I                NXP_SIUL2_PINMUX(0, 0, 90, 0, 171, 2)
#define PTC26_FXIO_D19_O                NXP_SIUL2_PINMUX(0, 0, 90, 3, 0, 0)
#define PTC26_LCU1_OUT9                 NXP_SIUL2_PINMUX(0, 0, 90, 6, 0, 0)
#define PTC27_ADC1_MA0                  NXP_SIUL2_PINMUX(0, 0, 91, 5, 0, 0)
#define PTC27_CAN5_TX                   NXP_SIUL2_PINMUX(0, 0, 91, 1, 0, 0)
#define PTC27_EIRQ22                    NXP_SIUL2_PINMUX(0, 0, 91, 0, 38, 3)
#define PTC27_EMIOS_1_CH4_H_I           NXP_SIUL2_PINMUX(0, 0, 91, 0, 84, 2)
#define PTC27_EMIOS_1_CH4_H_O           NXP_SIUL2_PINMUX(0, 0, 91, 2, 0, 0)
#define PTC27_FXIO_D20_I                NXP_SIUL2_PINMUX(0, 0, 91, 0, 172, 2)
#define PTC27_FXIO_D20_O                NXP_SIUL2_PINMUX(0, 0, 91, 3, 0, 0)
#define PTC27_LCU1_OUT3                 NXP_SIUL2_PINMUX(0, 0, 91, 6, 0, 0)
#define PTC28_CAN3_TX                   NXP_SIUL2_PINMUX(0, 0, 92, 1, 0, 0)
#define PTC28_EMIOS_1_CH7_H_I           NXP_SIUL2_PINMUX(0, 0, 92, 0, 87, 3)
#define PTC28_EMIOS_1_CH7_H_O           NXP_SIUL2_PINMUX(0, 0, 92, 2, 0, 0)
#define PTC28_FXIO_D21_I                NXP_SIUL2_PINMUX(0, 0, 92, 0, 173, 2)
#define PTC28_FXIO_D21_O                NXP_SIUL2_PINMUX(0, 0, 92, 3, 0, 0)
#define PTC28_FXIO_D2_I                 NXP_SIUL2_PINMUX(0, 0, 92, 0, 154, 7)
#define PTC28_FXIO_D2_O                 NXP_SIUL2_PINMUX(0, 0, 92, 4, 0, 0)
#define PTC28_LCU1_OUT8                 NXP_SIUL2_PINMUX(0, 0, 92, 6, 0, 0)
#define PTC28_LPI2C1_SCL_I              NXP_SIUL2_PINMUX(0, 0, 92, 0, 217, 4)
#define PTC28_LPI2C1_SCL_O              NXP_SIUL2_PINMUX(0, 0, 92, 5, 0, 0)
#define PTC29_CAN3_RX                   NXP_SIUL2_PINMUX(0, 0, 93, 0, 3, 3)
#define PTC29_EIRQ23                    NXP_SIUL2_PINMUX(0, 0, 93, 0, 39, 3)
#define PTC29_EMIOS_1_CH10_H_I          NXP_SIUL2_PINMUX(0, 0, 93, 0, 90, 1)
#define PTC29_EMIOS_1_CH10_H_O          NXP_SIUL2_PINMUX(0, 0, 93, 2, 0, 0)
#define PTC29_FXIO_D22_I                NXP_SIUL2_PINMUX(0, 0, 93, 0, 174, 2)
#define PTC29_FXIO_D22_O                NXP_SIUL2_PINMUX(0, 0, 93, 3, 0, 0)
#define PTC29_FXIO_D3_I                 NXP_SIUL2_PINMUX(0, 0, 93, 0, 155, 6)
