zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K312_172HDQFP-pinctrl.h
#define PTC29_FXIO_D3_O                 NXP_SIUL2_PINMUX(0, 0, 93, 7, 0, 0)
#define PTC29_LPI2C1_SDA_I              NXP_SIUL2_PINMUX(0, 0, 93, 0, 219, 3)
#define PTC29_LPI2C1_SDA_O              NXP_SIUL2_PINMUX(0, 0, 93, 5, 0, 0)
#define PTC30_CAN4_TX                   NXP_SIUL2_PINMUX(0, 0, 94, 1, 0, 0)
#define PTC30_EMIOS_1_CH12_H_I          NXP_SIUL2_PINMUX(0, 0, 94, 0, 92, 1)
#define PTC30_EMIOS_1_CH12_H_O          NXP_SIUL2_PINMUX(0, 0, 94, 2, 0, 0)
#define PTC30_FXIO_D0_I                 NXP_SIUL2_PINMUX(0, 0, 94, 0, 152, 4)
#define PTC30_FXIO_D0_O                 NXP_SIUL2_PINMUX(0, 0, 94, 3, 0, 0)
#define PTC30_FXIO_D23_I                NXP_SIUL2_PINMUX(0, 0, 94, 0, 175, 2)
#define PTC30_FXIO_D23_O                NXP_SIUL2_PINMUX(0, 0, 94, 7, 0, 0)
#define PTC31_CAN4_RX                   NXP_SIUL2_PINMUX(0, 0, 95, 0, 4, 3)
#define PTC31_EMIOS_1_CH14_H_I          NXP_SIUL2_PINMUX(0, 0, 95, 0, 94, 1)
#define PTC31_EMIOS_1_CH14_H_O          NXP_SIUL2_PINMUX(0, 0, 95, 2, 0, 0)
#define PTC31_FXIO_D1_I                 NXP_SIUL2_PINMUX(0, 0, 95, 0, 153, 4)
#define PTC31_FXIO_D1_O                 NXP_SIUL2_PINMUX(0, 0, 95, 3, 0, 0)
#define PTC31_FXIO_D24_I                NXP_SIUL2_PINMUX(0, 0, 95, 0, 176, 2)
#define PTC31_FXIO_D24_O                NXP_SIUL2_PINMUX(0, 0, 95, 7, 0, 0)
#define PTD0_LPUART5_RX                 NXP_SIUL2_PINMUX(0, 0, 96, 0, 192, 2)
#define PTD15_CAN3_RX                   NXP_SIUL2_PINMUX(0, 0, 111, 0, 3, 1)
#define PTD17_CAN5_RX                   NXP_SIUL2_PINMUX(0, 0, 113, 0, 5, 1)
#define PTD18_CAN2_TX                   NXP_SIUL2_PINMUX(0, 0, 114, 1, 0, 0)
#define PTD18_EMIOS_1_CH15_H_I          NXP_SIUL2_PINMUX(0, 0, 114, 0, 95, 1)
#define PTD18_EMIOS_1_CH15_H_O          NXP_SIUL2_PINMUX(0, 0, 114, 2, 0, 0)
#define PTD18_FXIO_D2_I                 NXP_SIUL2_PINMUX(0, 0, 114, 0, 154, 4)
#define PTD18_FXIO_D2_O                 NXP_SIUL2_PINMUX(0, 0, 114, 3, 0, 0)
#define PTD1_LPUART5_TX_I               NXP_SIUL2_PINMUX(0, 0, 97, 0, 368, 1)
#define PTD1_LPUART5_TX_O               NXP_SIUL2_PINMUX(0, 0, 97, 1, 0, 0)
#define PTD20_EIRQ25                    NXP_SIUL2_PINMUX(0, 0, 116, 0, 41, 3)
#define PTD20_EMIOS_1_CH17_Y_I          NXP_SIUL2_PINMUX(0, 0, 116, 0, 97, 1)
#define PTD20_EMIOS_1_CH17_Y_O          NXP_SIUL2_PINMUX(0, 0, 116, 2, 0, 0)
#define PTD20_FXIO_D25_I                NXP_SIUL2_PINMUX(0, 0, 116, 0, 177, 2)
#define PTD20_FXIO_D25_O                NXP_SIUL2_PINMUX(0, 0, 116, 3, 0, 0)
#define PTD20_LPSPI1_PCS2_I             NXP_SIUL2_PINMUX(0, 0, 116, 0, 234, 1)
#define PTD20_LPSPI1_PCS2_O             NXP_SIUL2_PINMUX(0, 0, 116, 5, 0, 0)
#define PTD20_LPSPI3_SIN_I              NXP_SIUL2_PINMUX(0, 0, 116, 0, 253, 2)
#define PTD20_LPSPI3_SIN_O              NXP_SIUL2_PINMUX(0, 0, 116, 6, 0, 0)
#define PTD21_EIRQ26                    NXP_SIUL2_PINMUX(0, 0, 117, 0, 42, 3)
#define PTD21_EMIOS_1_CH18_Y_I          NXP_SIUL2_PINMUX(0, 0, 117, 0, 98, 1)
#define PTD21_EMIOS_1_CH18_Y_O          NXP_SIUL2_PINMUX(0, 0, 117, 2, 0, 0)
#define PTD21_FXIO_D26_I                NXP_SIUL2_PINMUX(0, 0, 117, 0, 178, 2)
#define PTD21_FXIO_D26_O                NXP_SIUL2_PINMUX(0, 0, 117, 3, 0, 0)
#define PTD21_LCU0_OUT4                 NXP_SIUL2_PINMUX(0, 0, 117, 5, 0, 0)
#define PTD22_EIRQ27                    NXP_SIUL2_PINMUX(0, 0, 118, 0, 43, 3)
#define PTD22_EMIOS_1_CH19_Y_I          NXP_SIUL2_PINMUX(0, 0, 118, 0, 99, 1)
#define PTD22_EMIOS_1_CH19_Y_O          NXP_SIUL2_PINMUX(0, 0, 118, 2, 0, 0)
#define PTD22_FXIO_D27_I                NXP_SIUL2_PINMUX(0, 0, 118, 0, 179, 2)
#define PTD22_FXIO_D27_O                NXP_SIUL2_PINMUX(0, 0, 118, 3, 0, 0)
#define PTD22_LCU0_OUT5                 NXP_SIUL2_PINMUX(0, 0, 118, 6, 0, 0)
#define PTD23_EIRQ28                    NXP_SIUL2_PINMUX(0, 0, 119, 0, 44, 3)
#define PTD23_EMIOS_1_CH20_Y_I          NXP_SIUL2_PINMUX(0, 0, 119, 0, 100, 1)
#define PTD23_EMIOS_1_CH20_Y_O          NXP_SIUL2_PINMUX(0, 0, 119, 2, 0, 0)
#define PTD23_FXIO_D28_I                NXP_SIUL2_PINMUX(0, 0, 119, 0, 180, 2)
#define PTD23_FXIO_D28_O                NXP_SIUL2_PINMUX(0, 0, 119, 3, 0, 0)
#define PTD23_HSE_TAMPER_LOOP_OUT0      NXP_SIUL2_PINMUX(0, 0, 119, 5, 0, 0)
#define PTD23_LCU0_OUT10                NXP_SIUL2_PINMUX(0, 0, 119, 6, 0, 0)
#define PTD24_EIRQ29                    NXP_SIUL2_PINMUX(0, 0, 120, 0, 45, 3)
#define PTD24_EMIOS_1_CH21_Y_I          NXP_SIUL2_PINMUX(0, 0, 120, 0, 101, 1)
#define PTD24_EMIOS_1_CH21_Y_O          NXP_SIUL2_PINMUX(0, 0, 120, 2, 0, 0)
#define PTD24_FXIO_D29_I                NXP_SIUL2_PINMUX(0, 0, 120, 0, 181, 2)
#define PTD24_FXIO_D29_O                NXP_SIUL2_PINMUX(0, 0, 120, 3, 0, 0)
#define PTD24_HSE_TAMPER_EXTIN0         NXP_SIUL2_PINMUX(0, 0, 120, 0, 343, 2)
#define PTD24_LCU0_OUT11                NXP_SIUL2_PINMUX(0, 0, 120, 6, 0, 0)
#define PTD26_EMIOS_1_CH23_X_I          NXP_SIUL2_PINMUX(0, 0, 122, 0, 103, 1)
#define PTD26_EMIOS_1_CH23_X_O          NXP_SIUL2_PINMUX(0, 0, 122, 2, 0, 0)
#define PTD26_FXIO_D30_I                NXP_SIUL2_PINMUX(0, 0, 122, 0, 182, 2)
#define PTD26_FXIO_D30_O                NXP_SIUL2_PINMUX(0, 0, 122, 5, 0, 0)
#define PTD26_FXIO_D7_I                 NXP_SIUL2_PINMUX(0, 0, 122, 0, 159, 4)
#define PTD26_FXIO_D7_O                 NXP_SIUL2_PINMUX(0, 0, 122, 3, 0, 0)
#define PTD26_LCU0_OUT0                 NXP_SIUL2_PINMUX(0, 0, 122, 7, 0, 0)
#define PTD27_EIRQ30                    NXP_SIUL2_PINMUX(0, 0, 123, 0, 46, 2)
#define PTD27_FXIO_D31_I                NXP_SIUL2_PINMUX(0, 0, 123, 0, 183, 2)
#define PTD27_FXIO_D31_O                NXP_SIUL2_PINMUX(0, 0, 123, 5, 0, 0)
#define PTD27_LCU0_OUT1                 NXP_SIUL2_PINMUX(0, 0, 123, 7, 0, 0)
#define PTD28_EIRQ31                    NXP_SIUL2_PINMUX(0, 0, 124, 0, 47, 3)
#define PTD28_LCU0_OUT2                 NXP_SIUL2_PINMUX(0, 0, 124, 5, 0, 0)
#define PTD29_LCU0_OUT3                 NXP_SIUL2_PINMUX(0, 0, 125, 5, 0, 0)
#define PTD30_LCU0_OUT8                 NXP_SIUL2_PINMUX(0, 0, 126, 5, 0, 0)
#define PTD31_FXIO_D6_I                 NXP_SIUL2_PINMUX(0, 0, 127, 0, 158, 4)
#define PTD31_FXIO_D6_O                 NXP_SIUL2_PINMUX(0, 0, 127, 3, 0, 0)
#define PTD31_LCU0_OUT9                 NXP_SIUL2_PINMUX(0, 0, 127, 5, 0, 0)
#define PTD8_LPUART6_RX                 NXP_SIUL2_PINMUX(0, 0, 104, 0, 193, 1)
#define PTD9_LPUART6_TX_I               NXP_SIUL2_PINMUX(0, 0, 105, 0, 369, 2)
#define PTD9_LPUART6_TX_O               NXP_SIUL2_PINMUX(0, 0, 105, 4, 0, 0)
#define PTE0_LPUART7_RX                 NXP_SIUL2_PINMUX(0, 0, 128, 0, 194, 2)
#define PTE10_LPUART4_RX                NXP_SIUL2_PINMUX(0, 0, 138, 0, 191, 2)
#define PTE11_LPUART4_TX_I              NXP_SIUL2_PINMUX(0, 0, 139, 0, 367, 3)
#define PTE11_LPUART4_TX_O              NXP_SIUL2_PINMUX(0, 0, 139, 1, 0, 0)
#define PTE12_CAN5_TX                   NXP_SIUL2_PINMUX(0, 0, 140, 2, 0, 0)
#define PTE14_CAN4_RX                   NXP_SIUL2_PINMUX(0, 0, 142, 0, 4, 1)
#define PTE14_EIRQ13                    NXP_SIUL2_PINMUX(0, 0, 142, 0, 29, 4)
#define PTE14_EMIOS_0_CH19_Y_I          NXP_SIUL2_PINMUX(0, 0, 142, 0, 67, 3)
#define PTE14_EMIOS_0_CH19_Y_O          NXP_SIUL2_PINMUX(0, 0, 142, 1, 0, 0)
#define PTE14_FXIO_D7_I                 NXP_SIUL2_PINMUX(0, 0, 142, 0, 159, 5)
#define PTE14_FXIO_D7_O                 NXP_SIUL2_PINMUX(0, 0, 142, 6, 0, 0)
#define PTE14_LPUART5_TX_I              NXP_SIUL2_PINMUX(0, 0, 142, 0, 368, 2)
#define PTE14_LPUART5_TX_O              NXP_SIUL2_PINMUX(0, 0, 142, 4, 0, 0)
#define PTE15_CMP1_RR_ACTIVE            NXP_SIUL2_PINMUX(0, 0, 143, 5, 0, 0)
#define PTE17_FXIO_D5_I                 NXP_SIUL2_PINMUX(0, 0, 145, 0, 157, 4)
#define PTE17_FXIO_D5_O                 NXP_SIUL2_PINMUX(0, 0, 145, 3, 0, 0)
#define PTE18_FXIO_D4_I                 NXP_SIUL2_PINMUX(0, 0, 146, 0, 156, 4)
#define PTE18_FXIO_D4_O                 NXP_SIUL2_PINMUX(0, 0, 146, 3, 0, 0)
#define PTE19_EMIOS_0_CH22_X_I          NXP_SIUL2_PINMUX(0, 0, 147, 0, 70, 3)
#define PTE19_EMIOS_0_CH22_X_O          NXP_SIUL2_PINMUX(0, 0, 147, 2, 0, 0)
#define PTE1_LPUART7_TX_I               NXP_SIUL2_PINMUX(0, 0, 129, 0, 370, 3)
#define PTE1_LPUART7_TX_O               NXP_SIUL2_PINMUX(0, 0, 129, 6, 0, 0)
#define PTE21_EMIOS_1_CH1_H_I           NXP_SIUL2_PINMUX(0, 0, 149, 0, 81, 2)
#define PTE21_EMIOS_1_CH1_H_O           NXP_SIUL2_PINMUX(0, 0, 149, 2, 0, 0)
#define PTE22_EMIOS_1_CH2_H_I           NXP_SIUL2_PINMUX(0, 0, 150, 0, 82, 3)
#define PTE22_EMIOS_1_CH2_H_O           NXP_SIUL2_PINMUX(0, 0, 150, 2, 0, 0)
#define PTE23_EMIOS_1_CH3_H_I           NXP_SIUL2_PINMUX(0, 0, 151, 0, 83, 2)
#define PTE23_EMIOS_1_CH3_H_O           NXP_SIUL2_PINMUX(0, 0, 151, 2, 0, 0)
#define PTE24_CAN2_TX                   NXP_SIUL2_PINMUX(0, 0, 152, 3, 0, 0)
#define PTE24_EMIOS_1_CH4_H_I           NXP_SIUL2_PINMUX(0, 0, 152, 0, 84, 3)
#define PTE24_EMIOS_1_CH4_H_O           NXP_SIUL2_PINMUX(0, 0, 152, 2, 0, 0)
#define PTE24_FXIO_D11_I                NXP_SIUL2_PINMUX(0, 0, 152, 0, 163, 6)
#define PTE24_FXIO_D11_O                NXP_SIUL2_PINMUX(0, 0, 152, 7, 0, 0)
#define PTE24_FXIO_D5_I                 NXP_SIUL2_PINMUX(0, 0, 152, 0, 157, 10)
#define PTE24_FXIO_D5_O                 NXP_SIUL2_PINMUX(0, 0, 152, 5, 0, 0)
#define PTE25_CAN2_RX                   NXP_SIUL2_PINMUX(0, 0, 153, 0, 2, 3)
#define PTE25_EMIOS_1_CH5_H_I           NXP_SIUL2_PINMUX(0, 0, 153, 0, 85, 2)
#define PTE25_EMIOS_1_CH5_H_O           NXP_SIUL2_PINMUX(0, 0, 153, 2, 0, 0)
#define PTE26_EMIOS_1_CH6_H_I           NXP_SIUL2_PINMUX(0, 0, 154, 0, 86, 3)
#define PTE26_EMIOS_1_CH6_H_O           NXP_SIUL2_PINMUX(0, 0, 154, 2, 0, 0)
#define PTE3_CAN4_TX                    NXP_SIUL2_PINMUX(0, 0, 131, 1, 0, 0)
#define PTE3_LPUART5_RX                 NXP_SIUL2_PINMUX(0, 0, 131, 0, 192, 1)
#define PTE4_EIRQ4                      NXP_SIUL2_PINMUX(0, 0, 132, 0, 20, 4)
#define PTE4_EMIOS_0_CH18_Y_I           NXP_SIUL2_PINMUX(0, 0, 132, 0, 66, 2)
#define PTE4_EMIOS_0_CH18_Y_O           NXP_SIUL2_PINMUX(0, 0, 132, 4, 0, 0)
#define PTE4_EMIOS_1_CH4_H_I            NXP_SIUL2_PINMUX(0, 0, 132, 0, 84, 4)
#define PTE4_EMIOS_1_CH4_H_O            NXP_SIUL2_PINMUX(0, 0, 132, 3, 0, 0)
#define PTE4_FXIO_D6_I                  NXP_SIUL2_PINMUX(0, 0, 132, 0, 158, 1)
#define PTE4_FXIO_D6_O                  NXP_SIUL2_PINMUX(0, 0, 132, 6, 0, 0)
#define PTE4_LPSPI0_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 132, 0, 221, 5)
#define PTE4_LPSPI0_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 132, 1, 0, 0)
#define PTE4_LPSPI1_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 132, 0, 233, 5)
#define PTE4_LPSPI1_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 132, 2, 0, 0)
#define PTE5_EIRQ5                      NXP_SIUL2_PINMUX(0, 0, 133, 0, 21, 4)
#define PTE5_EMIOS_0_CH19_Y_I           NXP_SIUL2_PINMUX(0, 0, 133, 0, 67, 1)
#define PTE5_EMIOS_0_CH19_Y_O           NXP_SIUL2_PINMUX(0, 0, 133, 4, 0, 0)
#define PTE5_EMIOS_1_CH5_H_I            NXP_SIUL2_PINMUX(0, 0, 133, 0, 85, 4)
#define PTE5_EMIOS_1_CH5_H_O            NXP_SIUL2_PINMUX(0, 0, 133, 3, 0, 0)
#define PTE5_FXIO_D7_I                  NXP_SIUL2_PINMUX(0, 0, 133, 0, 159, 1)
#define PTE5_FXIO_D7_O                  NXP_SIUL2_PINMUX(0, 0, 133, 6, 0, 0)
#define PTE7_LPUART4_RX                 NXP_SIUL2_PINMUX(0, 0, 135, 0, 191, 4)
#define PTE9_CAN3_TX                    NXP_SIUL2_PINMUX(0, 0, 137, 4, 0, 0)

#endif /* _ZEPHYR_DTS_BINDING_S32K312_172HDQFP_WRAPPER_ */
